In [1]:
import pandas as pd

# melt() — Wide to Long
The melt() method in Pandas is used to unpivot a DataFrame from wide format to long format. In other words, it takes columns that represent different variables and combines them into key-value pairs (i.e., long-form data).

- When to Use melt():
When you have a DataFrame where each row is an observation, and each column represents a different variable or measurement, and you want to reshape the data into a longer format for easier analysis or visualization.

In [2]:
# Sample DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Math': [85, 78, 92],
    'Science': [90, 82, 89],
    'English': [88, 85, 94]
}

df = pd.DataFrame(data)

# Display the DataFrame
print(df)

      Name  Math  Science  English
0    Alice    85       90       88
1      Bob    78       82       85
2  Charlie    92       89       94

In [6]:
df.melt(id_vars=["Name"], value_vars=["Math","Science","English"], var_name="Subject", value_name="Score")

      Name  Subject  Score
0    Alice     Math     85
1      Bob     Math     78
2  Charlie     Math     92
3    Alice  Science     90
4      Bob  Science     82
5  Charlie  Science     89
6    Alice  English     88
7      Bob  English     85
8  Charlie  English     94

# Parameters:
- id_vars: The columns that you want to keep fixed (these columns will remain as identifiers).
- value_vars: The columns you want to unpivot (the ones you want to "melt" into a single column).
- var_name: The name to use for the new column that will contain the names of the melted columns (default is 'variable').
- value_name: The name to use for the new column that will contain the values from the melted columns (default is 'value').
- col_level: Used for multi-level column DataFrames.

# pivot( ) — Long to Wide
The pivot() function in Pandas is used to reshape data, specifically to turn long-format data into wide-format data. This is the reverse operation of melt().

- How it works:
  pivot() takes a long-format DataFrame and turns it into a wide-format    DataFrame by specifying which columns will become the new columns, the rows,  and the values.

In [10]:
df1 = df.melt(id_vars=["Name"], value_vars=["Math","Science","English"], var_name="Subject", value_name="Score")

In [11]:
df1.pivot(index="Name", columns="Subject", values="Score")

Subject  English  Math  Science
Name
Alice         88    85       90
Bob           85    78       82
Charlie       94    92       89

# Parameters:
- index: The column whose unique values will become the rows of the new DataFrame.
- columns: The column whose unique values will become the columns of the new DataFrame.
- values: The column whose values will fill the new DataFrame. These will become the actual data (values in the table).

# Why use pivot()?
- Better data structure: It makes data easier to analyze when you have categories that you want to split into multiple columns.
- Easier visualization: Often, you want to represent data in a format where categories are split across columns (for example, when creating pivot tables for reporting).
- Aggregating data: You can perform aggregations (like sum, mean, etc.) to group values before pivoting.

- Duplicate Entries: If you have multiple rows with the same combination of index and columns, pivot() will raise an error. In such cases, you should use pivot_table() (which can handle duplicate entries by aggregating them).

# Example of pivot_table() to handle duplicates:

In [13]:
data = {
    'Name': ['Alice', 'Bob', 'Bob', 'Charlie'],
    'Math': [85, 78, 91, 92],
    'Science': [90, 82, 75, 89],
    'English': [88, 85, 87, 94]
}

df2 = pd.DataFrame(data)

In [15]:
df3 = df2.melt(id_vars="Name", value_vars=["Math", "Science", "English"], var_name="Subject",value_name="Score")

In [16]:
df3

       Name  Subject  Score
0     Alice     Math     85
1       Bob     Math     78
2       Bob     Math     91
3   Charlie     Math     92
4     Alice  Science     90
5       Bob  Science     82
6       Bob  Science     75
7   Charlie  Science     89
8     Alice  English     88
9       Bob  English     85
10      Bob  English     87
11  Charlie  English     94

In [17]:
df3.pivot_table(index="Name", columns="Subject", values="Score", aggfunc="mean")

Subject  English  Math  Science
Name
Alice       88.0  85.0     90.0
Bob         86.0  84.5     78.5
Charlie     94.0  92.0     89.0